## 简答题

### 用简短的语言给出对分析、设计的理解。

> 1. 分析
>
>    - 强调对问题和要求的调查，而不是解决方案。例如，如果需要一个新的在线交易系统，如何使用它？它的功能是什么？
>    - 做正确的事
>
> 2. 设计
>
>    - 强调满足需求的概念解决方案（软件和硬件），而不是其实现。例如，数据库模式和软件对象的描述。
>
>    - 做正确的事



### 用一句话描述面向对象的分析与设计的优势。

> 分析人员不需要精通某一门专业语言，问题领域和实施层面的专家可以使用通用符号进行交流。



### 简述 UML（统一建模语言）的作用。考试考哪些图？

> UML是标准的图表语言，用于可视化分析和设计的结果。
>
> 考试要考的图：
>
> - 用例图：用户角度：功能、执行者
> - 静态图：系统静态结构
>   - 类图：概念及关系
>   - 对象图：某种状态或时间段内，系统中活跃的对象及其 关系
>   - 包图：描述系统的分解结构
> - 行为图：系统的动态行为
>   - 交互图：描述对象间的消息传递
>     - 顺序图：强调对象间消息发送的时序
>     - 合作图：强调对象间的动态协作关系 
>   - 状态图：对象的动态行为。状态-事件-状态迁移-响应动作
>   - 活动图：描述系统为完成某功能而执行的操作序列
> - 实现图：描述系统的组成和分布状况
>   - 构件图：组成部件及其关系
>   - 部署图：物理体系结构及与软件单元的对应关系



### 从软件本质的角度，解释软件范围（需求）控制的可行性

> 由于软件本身的复杂性、不可见性、一致性、可变性，软件范围多数情况下对于客户和开发者都是模糊的，这形成软件产品与其他产品不同的开发过程。因此，范围管理是软件项目管理的重中之重。在多数情况下，客户与开发者能就项目的 20% 内容给出严格的需求约定，80% 的内容都是相对模糊的。所以更需要对软件需求的控制，对目标系统提出完整、准确、清晰、具体的要求，确定系统必须完成哪些工作，而且需要在合适的时候对业务进行删减。
